Repository: scuffedgamedev/chat-ragdoll-racing-localization
Catalog: Exported XLIFF_*.xlf
Languages: de, fi, ru

# twitch-login
source: Login
de: Anmelden
fi: Kirjaudu
ru: Войти через Twitch

source: Single Player
de: Einzelspieler
fi: Yksinpeli
ru: Одиночная игра

source: Settings
de: Einstellungen
fi: Asetukset
ru: Настройки

source: Credits
fi: Tekijät
ru: О проекте

source: Quit
de: Beenden
fi: Sulje peli
ru: Выйти

source: Clear Cache
de: Cache leeren
fi: Resetoi välimuisti
ru: Очистить кэш

source: Waiting for login...
de: Warte auf Anmeldung…
fi: Odotetaan kirjautumista..
ru: Выполняется вход...

source: Controls
de: Steuerung
fi: Kontrollit
ru: Управление

source: Resume
de: Fortsetzen
fi: Jatka peliä
ru: Продолжить

source: Game mode
de: Spielmodus
fi: Pelimuoto
ru: Режим игры

# ffa
source: Free for all
de: Jeder gegen jeden
fi: Vapaa
ru: Все против всех

source: Competitive
de: Wettkampf
fi: Kilpailullinen
ru: Соревнование

source: Horse Racing
de: Pferderennen
fi: Hevosralli
ru: Скачки

# ffa-explanation
source: * For fun play mode where streamer can interact with the world with variables and commands * Join through chat * No leaderboard
de: * Spannender Spielmodus, in dem der Streamer die Welt mit Voreinstellungen und Kommandos kontrolliert. * Mach mit im Chat! * Keine Rangliste.
fi: * Vapaa, huvittava pelimuoto, missä ei ole rajoja mitä streamaaja voi tehdä * Liittyminen chatin kautta * Ei rankiglistaa
ru: * Интерактивный режим, самое веселье :) * Cтример контролирует ход игры через команды и переменные * Подключение к игре через чат * Без доски лидеров

# competitive-explanation
source: * Basic Competitive gamemode * Join through chat * No variables or commands * Leaderboard
de: * Ein simpler Wettkampfsmodus * Mach mit im Chat! * Keine Voreinstellungen oder Kommandos * Rangliste
fi: * Perus kilpailumoodi * Liittyminen chatin kautta * Ranking lista
ru: * Базовый соревновательный режим * Стример не контролирует игру * Подключение к игре через чат * Есть доска лидеров

source: Movement
de: Bewegung
fi: Ohjaus
ru: Движение

source: Rotation
de: Drehung
fi: Kameran kääntäminen
ru: Вращение

source: Follow Player
de: Spieler folgen
fi: Seuraa pelaajaa
ru: Отслеживать

# horse-explanation
source: * Competitve gamemode * No joining through chat * Vote on winning player
de: * Profi-Wettkampfmodus * keine Beteiligung im Chat * Wetten auf den Gewinner
fi: * Kilpailullinen pelimoodi * Ei chattiliittymistä * Äänestä voittajaa chatin kautta
ru: * Гонка лошадей! * Стример и игроки не контролируют игру * Можно голосовать за победителя

source: Back
de: Zurück
fi: Takaisin
ru: Назад

source: Level Selection
de: Level-Auswahl
fi: Kartta
ru: Выбор уровня

source: Start
fi: Aloita
ru: Начать

source: Spawn players
de: Spieler hinzufügen
fi: Lisää pelaajia
ru: Разместить игроков

source: Respawn obstacles
de: Hindernisse neu spawnen
fi: Lisää esteitä
ru: Сброс препятствий

# setting
source: Settings
de: Einstellungen
fi: Asetukset
ru: Настройки

source: Manual camera
de: Manuelle Kamera
fi: Manuaali kamera
ru: Свободная камера

source: Nameplates
de: Spielernamen
fi: Nimet
ru: Имена игроков

source: Optimized
de: Optimiert
fi: optimisoitu
ru: Оптимизация

# multispawns
source: 1 join per player
de: 1 Beitritt pro Spieler
fi: jokainen pelaaja voi liittyä vain kerran
ru: Один персонаж на игрока

source: Automatic Start
de: Automatisch starten
fi: Automaattinen aloitus
ru: Автозапуск

source: Characters Per Player
de: Spieler pro Person
fi: Hahmoja pelaajia kohtaan
ru: Лимит персонажей на игрока

source: Max Ragdolls
de: Maximum Ragdoll
fi: Maksimi hahmomäärä
ru: Общий лимит персонажей

source: camera movement speed
de: Kamera Geschwindigkeit
fi: kameran liikkumisnopeus
ru: Скорость камеры

source: mouse sensitivity
de: Maus Sensitivität
fi: hiiren sensitiviteetti
ru: Чувствительности мыши

source: Sound Effects
de: Soundeffekte
fi: ääniefektien volyymi
ru: Звуковые эффекты

source: full screen
de: Vollbild
fi: kokonäyttötila
ru: Полный экран

source: enable particles
de: Partikel anzeigen
fi: Partiikkelit
ru: Частицы

source: enable character dragging
de: Charakter manipulation aktivieren
fi: hahmojen vetäminen hiirellä
ru: Перетаскивание игроков

source: enable streamer icon
de: Streamer Symbol anzeigen
fi: näytä streami iconi paidassa
ru: Иконка стримера

source: Resolution
de: Bildschirmauflösung
fi: Resoluutio
ru: Качество

source: enable obstacles command
de: Hindernis Kommando aktivieren
fi: ota esteiden komento käyttöön
ru: Управление препятствиями из чата

source: enable jump command
de: Sprung Kommando aktivieren
fi: ota hyppy komento käyttöön
ru: Управление прыжком из чата

# enable pathfinding
source: enhanced AI
de: Erweiterte KI
fi: edistynyt AI
ru: Улучшенный ИИ

source: timescale
de: Zeitskala
fi: pelin nopeus
ru: Скорость игры

# speed
source: Running speed
de: Bewegungsgeschwindigkeit
fi: Juoksunopeus
ru: Скорость персонажей

source: obstacle cooldown
de: Hindernis spawn Abklingzeit
fi: esteiden spawnaus odotusaika
ru: Таймер препятствий

source: up force
de: Charakter aufrichtende Kraftstärke
fi: pystyseisomisen vahvuus
ru: Осанка персонажей

source: head muscle strength
de: Kopfmuskel Stärke
fi: päälihaksen vahvuus
ru: Мощность головы

source: leg muscle strength
de: Beinmuskel Stärke
fi: jalkalihasten vahvuus
ru: Мощность ног

source: hand muscle strength
de: Handmuskel Stärke
fi: käsilihasten vahvuus
ru: Мощность рук

source: torso strength
de: Oberkörper Stärke
fi: vartalolihaksen vahvuus
ru: Мощность торса

source: balance
de: Charakter Gesamtstärke
fi: tasapainotuksen vahvuus
ru: Баланс

source: enable minimap
de: Minikarte aktivieren
fi: käytä pikkukarttaa
ru: Мини карта

# map-city
source: City
de: Stadt
fi: Kaupunki
ru: Город

# map-dungeon
source: Dungeon
de: Verlies
fi: Vankityrmä
ru: Подземелье

# map-western
source: Western
fi: Länsimainen
ru: Дикий запад

# default-instructions
source: !join to participate !obstacle to spawn obstacles !jump to add upwards force
de: !join um beizutreten !obstacle um Hindernisse hinzuzufügen !jump um zu springen
fi: !join liittyäksesi !obstacle spawnaa esteen !jump hyppää hahmollasi
ru: !join для участия в игре !obstacle для создания препятствий !jump для прыжка персонажа

source: language
de: Sprache
fi: kieli
ru: Язык

# horse-instructions
source: vote for winning player in chat
de: Wette auf deinen Favoriten im Chat
fi: äänestä voittajaa chatissa
ru: Голосование за персонажа в чате

source: has died.
de: ist gestorben.
fi: kuoli.
ru: погиб.

source: just discovered gravity!
de: hat die Schwerkraft entdeckt!
fi: keksi painovoiman!
ru: открыл гравитацию!

source: has joined the race!
de: ist dem Rennen beigetreten!
fi: littyi kisaan!
ru: присоединился к забегу!

source: Starting:
de: Starte in:
fi: Alku:
ru: Начинаем:

source: has finished the the race at:
de: hat das Rennen beendet auf Platz:
fi: pääsi maaliin:
ru: финишировал в:

source: just fell off!
de: ist gerade heruntergefallen!
fi: putosi!
ru: упал!

source: Skin Selection
fi: Hahmon valinta
ru: выбор персонажа
